{
  "basics": {
    "name": "Kristján Oddsson",
    "label": "Developer",
    "email": "koddsson@gmail.com",
    "website": "http://koddsson.com",
    "location": {
      "city": "London",
      "countryCode": "UK"
    },
    "profiles": [
      {
        "network": "Twitter",
        "username": "koddsson",
        "url": "https://twitter.com/koddsson"
      },
      {
        "network": "Github",
        "username": "koddsson",
        "url": "https://github.com/koddsson"
      }
    ]
  },
  "work": [
    {
      "company": "Cloudflare",
      "position": "Front-end engineer",
      "website": "https://cloudflare.com",
      "startDate": "2016-11-01",
      "summary": "Working on the client dashboard for cloudflare.com as well as helping make descision on what new ",
      "highlights": [
        "Crafted a small chrome extension to redirect live platform requests to a local web server in order to develop new features faster against real data."
      ]
    },
    {
      "company": "QuizUp",
      "position": "Web engineer",
      "website": "http://quizup.com",
      "startDate": "2016-01-17",
      "endDate": "2016-10-30",
      "summary": "Started in the web tools team to build and maintain internal systems. Jumped around the tech stack to accommodate the pivoting of the company. Ended up working on backend services in mix with internal webs as well as quizup.com",
      "highlights": [
        "Migrated a very large and complicated codebase from heroku to AWS"
      ]
    },
    {
      "company": "Bókun",
      "position": "Head of Front-end development",
      "website": "http://bokun.io",
      "startDate": "2015-06-01",
      "endDate": "2016-01-15",
      "summary": "Working on several web-apps within the company set to replace key areas within the Bókun platform"
    },
    {
      "company": "Gagnavarslan/Azazo",
      "position": "Mid-level Developer",
      "website": "http://azazo.com",
      "startDate": "2012-01-02",
      "endDate": "2015-06-01",
      "summary": "Started as a 'devop' in the sysadmin space at Azazo working on automating trivial tasks for developers and sysadmins alike. Worked my way up the infrastructure stack to the frontend where I worked on a new UI for the companies flagship product Coredata.",
      "highlights": [
        "Got first place at a company hackathon in 2014 for a working Google Drive integration with another co-worker",
        "Got second place in a 2013 company hackathon for a small arduino traffic light test status indicator",
        "Setup a Logstash/Kibana/Elasticsearch cluster that recieves incoming logs from servers and serves 'em up centrally in a nice GUI",
        "Pushed for strating writing ECMAScript6 using a transpiler for the front-end"
      ]
    },
    {
      "company": "Reykjavík University",
      "position": "Teachers assistant for Web Programming I",
      "website": "http://ru.is/",
      "startDate": "2013-01-01",
      "endDate": "2013-06-01",
      "summary": "Supervised lab classes, held a few lectures and graded assignments and tests. The class is a crash-course on web programming teaching HTML, CSS, Javascript, jQuery, C#, Microsofts C# MVC, web services, AJAX and more."
    },
    {
      "company": "Arion bank",
      "position": "Developer",
      "website": "http://arionbanki.is",
      "startDate": "2012-06-01",
      "endDate": "2012-12-01",
      "summary": "Worked on the banks web-based personal banking solution. Spent most of my time system bug hunting/fixing. The stack would consist of ASP.NET MVC, C#, jQuery & MSSQL.",
      "highlights": []
    },
    {
      "company": "Arion bank",
      "position": "Working on a B.Sc. Final project",
      "website": "http://arionbanki.is",
      "startDate": "2012-09-01",
      "endDate": "2012-12-30",
      "summary": "Worked on a investment fund simulation game as a B.Sc. project. Players would invest virtual money in real funds at Arion Bank and their return would take aim from real data. Its main objective was to introduce people to investment funding without the risk. While the game did not move forward after the project was complete (i.e. it never went live) the people in the group all recieved a passing grade and graduated B.Sc. in computer science that spring. My role in the group was mostly backend related although we took a 'Full Stack' approach to it"
    },
    {
      "company": "Project X course, Reykjavik University",
      "position": "Lead developer",
      "startDate": "2012-09-01",
      "endDate": "2012-12-30",
      "summary": "A collabaration between Reykjavík University and Össur Bionics. The project was building a test robot for Össur so that they could better test their bionics without the need for calling in amputees and collecting data from them manually. I was the only programmer in a group of 15 and the rest were bio–engineers. Although we took a 'Full stack' approach I did most of the programming and didn’t do a lot of hardware work."
    },
    {
      "company": "Íslandsbanki",
      "position": "Developer",
      "website": "http://islandsbanki.is",
      "startDate": "2010-01-01",
      "endDate": "2011-01-01",
      "summary": "Started working on some changes to a specialized car loans application written in Classic ASP and AS/400 and was then moved to the banks web-based personal banking solution. Most of the work in the online banking solution was developed in Microsofts C# MVC, Oracle SQL and jQuery."
    }
  ],
  "volunteer": [
    {
      "organization": "Mozilla",
      "position": "Code Contributer",
      "website": "http://mozilla.com/",
      "startDate": "2014-10-15",
      "summary": "Made numerous contributions to various mozilla projects from the snippets service that serves 4-5 billion pageviews a day to small support pages, doing everything from changing how a system handles data structures to convert a existing website to be responsive."
    }, {
      "organization": "apis.is",
      "position": "Code Contributer",
      "website": "http://apis.is/",
      "startDate": "2014-09-06",
      "summary": "Started off doing some bugfixes, code cleanup and adding features and ended up getting jumped into the core developer team where I help make decisions on arcitecture of the project, design of assets and oversee pull requests and incoming issues."
    }
  ],
  "education": [
    {
      "institution": "Reykjavík University",
      "area": "Computer Science",
      "studyType": "Bachelor",
      "startDate": "2009-01-01",
      "endDate": "2012-01-01"
    },
    {
      "institution": "Technical College of Reykjavík",
      "area": "Information Technology",
      "studyType": "College",
      "startDate": "2005-01-01",
      "endDate": "2008-01-01"
    }
  ],
  "awards": [{
    "title": "2nd place at IceCTF, the Icelandic Hacking Competition",
    "date": "2016-08-26",
    "awarder": "IceCTF",
    "summary": "IceCTF is a computer security contest targeted at anyone with an interest in computer science. The game consists of a series of challenges where participants must reverse engineer, break, hack, decrypt, or do whatever it takes to solve the challenge. The challenges are all set up with the intent of being hacked, making it a great way to get some hands-on experience."
  }],
  "skills": [
    {
      "name": "Scala"
    }, {
      "name": "Python"
    }, {
      "name": "C#"
    }, {
      "name": "Java"
    }, {
      "name": "Clojure"
    }, {
      "name": "Systems administration"
    }, {
      "name": "Web Development",
      "keywords": [
        "Responsive design",
        "HTML",
        "CSS",
        "LESS",
        "Javascript",
        "ClojureScript",
        "react",
        "angular",
        "jQuery"
      ]
    }, {
      "name": "Databases",
      "keywords": [
        "PostgreSQL", "MySQL", "MSSQL", "Oracle", "AS/400"
      ]
    }, {
      "name": "Operating systems",
      "keywords": [
        "Linux/Unix", "OSX", "Windows"
      ]
    }
  ],
  "languages": [
    {
      "language": "Icelandic",
      "fluency": "Native speaker"
    },
    {
      "language": "English",
      "fluency": "Fluent second language"
    }
  ]
}
